---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalyticalModelSelector Properties
AnalyticalModelSelector Class See Also Send Feedback
---

The AnalyticalModelSelector type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurveSelector | The portion of the curve to be selected. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

AnalyticalModelSelector Class

Autodesk.Revit.DB.Structure Namespace